cf_billing/DataProcessors/энргДоговорыКонтрагентовМенеджер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>энргДоговорыКонтрагентовМенеджер</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cf_billing/InformationRegisters/энргДоговорыАбонентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргДоговорыАбонентов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Catalogs/энргДоговорыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргДоговорыКонтрагентов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.энргАбоненты</xr:Item>
				<xr:Item>Catalog.энргДоговорыКонтрагентов</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>800</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестТипыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДоговора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестСтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестСтатусыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаФинансирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестГруппыФинансирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйНомерДоговораОРЭМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>38</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговораОРЭМ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестТипыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>бестКодДоговораERP</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расчетчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БанковскийСчетКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргФилиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПролонгацияДоговора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачислениеПени</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособЗаключенияДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргСпособыЗаключенияДоговора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Публичный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестВидыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезУслугиПоПередаче</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПролонгации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияКонтрагента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестКатегорииКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VIPКлиент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаличиеЭкспертногоЗаключения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронноеВзаимодействие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестВидыЭлектронногоВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаДоговор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Мощность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияПотребителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестКатегорииКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокЮридическихЛиц</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеДопСоглашения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПередачиУведомленийПИР</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестВидыЭлектронногоВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВзаимодействиеСЭДО</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаРасчеты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоставщикКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестТипыТарифаНезависимыйСбыт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеноваяКатегория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестЦеновыеКатегории</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТарифнаяСетка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестТарифныеСетки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеСкидки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРасторжения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отрасль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргОтрасли</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Министерство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргМинистерства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузополучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Плательщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКОПФ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКВЭД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаСуммыДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияСуммыДоговора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактныеЛицаКонтрагентов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бестКонтактныеЛицаКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОбъектыБизнесПроцесса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектБП</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бестИзменитьНомерПломбыПрибораУчета</v8:Type>
								<v8:Type>cfg:DocumentRef.бестАктированиеНедопускаДопускаЮЛ</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьНагрузкуПоУслугам</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьФормулуРасчетаТочекУчетаНП</v8:Type>
								<v8:Type>cfg:DocumentRef.бестИзменитьПараметрыТочкиУчета</v8:Type>
								<v8:Type>cfg:DocumentRef.бестАктПринятияПрибораУчетаККоммерческомуУчету</v8:Type>
								<v8:Type>cfg:DocumentRef.бестИзменениеТемпературногоГрафикаОбъектов</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьУчастиеОбъектаВРаспределенииРесурсовВМКД</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьГарантированныеОбъемыНП</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьЗначениеПлощадиНП</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьТемпературыИсточника</v8:Type>
								<v8:Type>cfg:DocumentRef.бестИзмененитьРазрядностьОбъемовУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.бестОперацияСПриборомУчетаНП</v8:Type>
								<v8:Type>cfg:DocumentRef.бестОперацияСУслугамиНП</v8:Type>
								<v8:Type>cfg:DocumentRef.бестИзменениеПривязкиТочкиУчетаНПКСтруктуреСети</v8:Type>
								<v8:Type>cfg:DocumentRef.бестИзменитьДоговорПоУслуге</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьГруппуПотребителейНП</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьТемпературуНаружногоВоздуха</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьТочкиПоставкиНаОбъектРасчета</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьСпособНачисленияПоНормативуНП</v8:Type>
								<v8:Type>cfg:DocumentRef.бестЗаключениеДоговоровСЮридическимиЛицами</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьПотребителейГВС</v8:Type>
								<v8:Type>cfg:DocumentRef.бестСменаПоставщикаНП</v8:Type>
								<v8:Type>cfg:DocumentRef.бестИзменитьДанныеДляДополнительногоРасчета</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьСреднемесячнуюТемпературу</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьДатуПоверкиПУ</v8:Type>
								<v8:Type>cfg:DocumentRef.бестУстановитьПоказателиТемпературыВнутриПомещения</v8:Type>
								<v8:Type>cfg:DocumentRef.бестРегистрацияБездоговорногоБезучетногоПотребления</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/DataProcessors/энргДоговорыКонтрагентовМенеджер/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ЗначенияСвойствОбъекта(Договор, ПолучаемыеСвойства) Экспорт 
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжДоговорыКонтрагентовМенеджер") = Неопределено Тогда
				Возврат Обработки["слжДоговорыКонтрагентовМенеджер"].ЗначенияСвойствОбъекта(Договор, ПолучаемыеСвойства);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Результат = Справочники.энргДоговорыКонтрагентов.ЗначенияСвойствОбъекта(Договор, ПолучаемыеСвойства);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "ДоговорыКонтрагентовМенеджер.ЗначенияСвойствОбъекта";
		ПараметрыМетода 			= Новый Структура("Договор, ПолучаемыеСвойства", Договор, ПолучаемыеСвойства);
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция НайтиДействующийДоговорПоПараметрам(Организация, Район, Контрагент, ДатаОкончанияДействия) Экспорт 
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		Если слжОбщегоНазначенияМодуль.ВоспроизводитьРезультатМетодов() Тогда; 
			Если НЕ Метаданные.Обработки.Найти("слжДоговорыКонтрагентовМенеджер") = Неопределено Тогда
				Возврат Обработки["слжДоговорыКонтрагентовМенеджер"].НайтиДействующийДоговорПоПараметрам(Организация, Район, Контрагент, ДатаОкончанияДействия);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Результат = Справочники.энргДоговорыКонтрагентов.НайтиДействующийДоговорПоПараметрам(Организация, Район, Контрагент, ДатаОкончанияДействия);
	
	Если ОбщегоНазначения.ПодсистемаСуществует("слжСлужебная") Тогда
		ИмяМетода 					= "ДоговорыКонтрагентовМенеджер.НайтиДействующийДоговорПоПараметрам";
		ПараметрыМетода 			= Новый Структура("Организация, Район, Контрагент, ДатаОкончанияДействия", Организация, Район, Контрагент, ДатаОкончанияДействия);
		слжОбщегоНазначенияМодуль 	= ОбщегоНазначения.ОбщийМодуль("слжОбщегоНазначения");
		слжОбщегоНазначенияМодуль.Логгер().ЗаписатьРезультат(ИмяМетода, Результат, ПараметрыМетода);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДоговорАбонента(Период, Абонент) Экспорт
	
	СхемаЗапроса	= Неопределено;
	ПараметрыОтбора	= Новый Структура;
	ПараметрыВТ 	= Новый Массив;
	ПараметрыВТ.Добавить(энргФормированиеТекстовЗапроса.ПараметрТипРавно(Новый Структура("Абонент", "Абонент"))); 
	
	Если ЗначениеЗаполнено(Период) Тогда
		ПараметрыОтбора.Вставить("Период", энргФормированиеТекстовЗапроса.ПараметрПериодРавно("Период"));
	КонецЕсли;
	ПараметрыОтбора.Вставить("ПараметрыВТ", ПараметрыВТ);	
	
	РегистрыСведений.энргДоговорыАбонентов.ПолучитьАктуальныйДоговорАбонента(СхемаЗапроса, ПараметрыОтбора);	 
			
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("Период"	, Период);
	ПараметрыЗапроса.Вставить("Абонент"	, Абонент);		
	РезультатЗапроса = энргСхемаЗапросаСервер.ВыполнитьЗапрос(СхемаЗапроса, ПараметрыЗапроса);
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Справочники.энргДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Результат = Выборка.Договор;
	
	Возврат Результат;
	
КонецФункции

Процедура СменитьСтатусДоговораАбонента(Период, Абонент, Статус) Экспорт
	
	Договор = ПолучитьДоговорАбонента(Период, Абонент);
	СменитьСтатусДоговора(Договор, Статус);
	
КонецПроцедуры

Функция ОписаниеОбъекта() Экспорт 
	
	Результат = Новый Структура;
	ЗаполнитьСтруктуруОписанияОбъекта(Результат);	
	Возврат Результат;
	
КонецФункции

// Функция - Вернуть банковские счета контрагента
//
// Параметры:
//  Контрагент - СправочникСсылка.энргКонтрагенты - Контрагент
// 
// Возвращаемое значение:
//   Массив - массив банковских счетов контрагента 
//
Функция ВернутьБанковскиеСчетаКонтрагента(Контрагент) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	БанковскиеСчета.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.БанковскиеСчета КАК БанковскиеСчета
	|ГДЕ
	|	БанковскиеСчета.Владелец = &Контрагент И НЕ БанковскиеСчета.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СменитьСтатусДоговора(Договор, Статус)
	
	ДоговорОбъект = Договор.ПолучитьОбъект();
	ДоговорОбъект.Статус = Статус;
	ДоговорОбъект.Записать();
	
КонецПроцедуры

Процедура ЗаполнитьСтруктуруОписанияОбъекта(Результат)
	
	Результат.Вставить("Ссылка", 					Справочники.энргДоговорыКонтрагентов.ПустаяСсылка());
	Результат.Вставить("Организация", 				Справочники.Организации.ПустаяСсылка());
	Результат.Вставить("Район", 					Справочники.энргЗоныОтвественности.ПустаяСсылка());
	Результат.Вставить("Контрагент", 				Справочники.энргКонтрагенты.ПустаяСсылка());
	Результат.Вставить("Номер", 					"");
	Результат.Вставить("Дата", 						Дата(1,1,1));
	Результат.Вставить("СпособЗаключенияДоговора", 	Перечисления.энргСпособыЗаключенияДоговора.ПустаяСсылка());
	Результат.Вставить("Публичный", 				Ложь);
	Результат.Вставить("НачислениеПени",			Ложь);
	Результат.Вставить("Статус",					Перечисления.бестСтатусыДоговоровКонтрагентов.ПустаяСсылка());
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
